package com.daxavic.Tar;

/**
 Вариант 6 -- Tar (*)
 Соединяет заданные в командной строке входные текстовые файлы в выходной,
 указываемый после ключа -out. С ключом -u делает обратную операцию, принимая
 один входной файл и разбивая его на несколько.
 Выходной файл тоже является текстовым. Придумать для него формат, позволяющий
 запоминать имена входных файлов и находить их границы.
 Command Line: Tar -u filename.txt или
 Tar file1.txt file2.txt … -out output.txt.
 Кроме самой программы, следует написать автоматические тесты к ней.
 */

        import java.io.*;
        import java.util.ArrayList;
 public class Tar {

        private boolean isOutputFile = false;
        // Создаем конструктор из строки:
        Tar (String[] val){

        }

    }


